## Staging Plan
#### SHA: `8173b7c19333889927eba06acd3e981319721a10`
#### PR: `8`

#### ⚙️  Initialize `success`
#### 🗄️ Workspace ``   
#### 📖 Plan `success`

<details><summary>Show Plan</summary>

```

module.postbuild_pointy.aws_iam_role.lambda_exec: Refreshing state... [id=-pointy-lambda_execution_role]
module.postbuild_pointy.aws_acm_certificate.www_cert: Refreshing state... [id=arn:aws:acm:us-west-2:533267310428:certificate/bd717904-4407-49ce-a2b9-4cff4411a61b]
module.postbuild_pointy.aws_sns_topic.ecs_alerts: Refreshing state... [id=arn:aws:sns:us-west-2:533267310428:-pointy-ecs-cpu-alerts]
module.redirect_reviso.aws_acm_certificate.old_domain_cert: Refreshing state... [id=arn:aws:acm:us-west-2:533267310428:certificate/03ff5118-2632-4f96-ba3f-bcaa4d8770d8]
module.postbuild_pointy.aws_acm_certificate.app_cert: Refreshing state... [id=arn:aws:acm:us-west-2:533267310428:certificate/1472e0e6-f850-44d4-8aa1-d4a4ab90bc66]
module.postbuild_pointy.aws_iam_policy.lambda_sns_policy: Refreshing state... [id=arn:aws:iam::533267310428:policy/-pointy-lambda_sns_policy]
module.postbuild_pointy.aws_ecs_cluster.default: Refreshing state... [id=arn:aws:ecs:us-west-2:533267310428:cluster/pointy]
module.postbuild_pointy.aws_lambda_function.ecs_alerts: Refreshing state... [id=-pointy-ECSCPUAlerts]
module.postbuild_pointy.aws_lb.web_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:loadbalancer/app/pointy-web-alb/4a61b96ac7b3592d]
module.postbuild_pointy.aws_lb.app_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:loadbalancer/app/pointy-app-alb/22245f02fa9f475a]
module.redirect_reviso.aws_lb.redirect_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:loadbalancer/app/reviso-biz-redirect-alb/f81071d1fb62a779]
module.postbuild_pointy.aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=-pointy-lambda_execution_role-20250220220734220800000001]
module.postbuild_pointy.aws_ecs_task_definition.server: Refreshing state... [id=pointy-server]
module.redirect_reviso.aws_route53_record.old_domain_cert_validation["reviso.biz"]: Refreshing state... [id=Z0893527DM29OSHJP7NG__2d19292f3c0065d0ba4d585ac3cb4f68.reviso.biz._CNAME]
module.postbuild_pointy.aws_route53_record.www_cert_validation["www.test.pointy.ai"]: Refreshing state... [id=Z036564521TUMO3XKOL1V__bbc58cc88f1bbef5f1672734bb3e3b31.www.test.pointy.ai._CNAME]
module.postbuild_pointy.aws_route53_record.app_cert_validation["app.test.pointy.ai"]: Refreshing state... [id=Z036564521TUMO3XKOL1V__b6e4ae139628a416e254bc5d74611182.app.test.pointy.ai._CNAME]
module.postbuild_pointy.aws_acm_certificate_validation.www_cert_validation: Refreshing state... [id=2025-02-20 20:13:52.975 +0000 UTC]
module.postbuild_pointy.aws_lb_target_group.web_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:targetgroup/pointy-web-tg/4f5579b8a35681f2]
module.postbuild_pointy.aws_lb_target_group.server_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:targetgroup/pointy-server-tg/8883e71f215b1894]
module.postbuild_pointy.aws_acm_certificate_validation.app_cert_validation: Refreshing state... [id=2025-02-20 20:13:55.824 +0000 UTC]
module.postbuild_pointy.aws_lambda_permission.allow_sns_to_call_lambda: Refreshing state... [id=AllowExecutionFromSNS]
module.postbuild_pointy.aws_sns_topic_subscription.lambda_subscription: Refreshing state... [id=arn:aws:sns:us-west-2:533267310428:-pointy-ecs-cpu-alerts:05f03a16-b101-43dd-a6e3-10619c7d49d8]
module.postbuild_pointy.aws_ecs_task_definition.web: Refreshing state... [id=pointy-web]
module.postbuild_pointy.aws_route53_record.www: Refreshing state... [id=Z036564521TUMO3XKOL1V_www.test.pointy.ai_A]
module.postbuild_pointy.aws_route53_record.app: Refreshing state... [id=Z036564521TUMO3XKOL1V_app.test.pointy.ai_A]
module.postbuild_pointy.aws_lb_listener.www_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/pointy-web-alb/4a61b96ac7b3592d/60cb3ee4f67bd714]
module.postbuild_pointy.aws_lb_listener.server_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/pointy-app-alb/22245f02fa9f475a/f739ca38124d6010]
module.redirect_reviso.aws_route53_record.old_app_domain: Refreshing state... [id=Z0893527DM29OSHJP7NG_app.reviso.biz_A]
module.redirect_reviso.aws_route53_record.old_root_domain: Refreshing state... [id=Z0893527DM29OSHJP7NG_reviso.biz_A]
module.redirect_reviso.aws_route53_record.old_web_domain: Refreshing state... [id=Z0893527DM29OSHJP7NG_www.reviso.biz_A]
module.redirect_reviso.aws_lb_listener.http_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/reviso-biz-redirect-alb/f81071d1fb62a779/99b84c1fc87e154c]
module.postbuild_pointy.aws_lb_listener.web_front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/pointy-web-alb/4a61b96ac7b3592d/08b88ea108aaf6ae]
module.postbuild_pointy.aws_lb_listener.server_front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/pointy-app-alb/22245f02fa9f475a/e65c2cb7718cd08b]
module.redirect_reviso.aws_lb_listener_rule.http_www_domain_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener-rule/app/reviso-biz-redirect-alb/f81071d1fb62a779/99b84c1fc87e154c/c40ce9d1887bcb97]
module.redirect_reviso.aws_lb_listener_rule.http_app_domain_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener-rule/app/reviso-biz-redirect-alb/f81071d1fb62a779/99b84c1fc87e154c/d880f779e074893c]
module.redirect_reviso.aws_lb_listener_rule.http_root_domain_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener-rule/app/reviso-biz-redirect-alb/f81071d1fb62a779/99b84c1fc87e154c/3e8c5cae5807c4a6]
module.postbuild_pointy.aws_ecs_service.web: Refreshing state... [id=arn:aws:ecs:us-west-2:533267310428:service/pointy/pointy-web]
module.postbuild_pointy.aws_ecs_service.server: Refreshing state... [id=arn:aws:ecs:us-west-2:533267310428:service/pointy/pointy-server]
module.postbuild_pointy.aws_cloudwatch_metric_alarm.high_cpu_utilization: Refreshing state... [id=-pointy-high-cpu-utilization]
module.postbuild_pointy.aws_cloudwatch_metric_alarm.low_cpu_utilization: Refreshing state... [id=-pointy-low-cpu-utilization]
module.postbuild_pointy.aws_cloudwatch_metric_alarm.health_check_failures: Refreshing state... [id=-pointy-health-check-failures]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.postbuild_pointy.aws_ecs_task_definition.server has been changed
  ~ resource "aws_ecs_task_definition" "server" {
        id                       = "pointy-server"
      + tags                     = {}
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.postbuild_pointy.aws_ecs_task_definition.web has been changed
  ~ resource "aws_ecs_task_definition" "web" {
        id                       = "pointy-web"
      + tags                     = {}
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.redirect_reviso.aws_lb_listener.http_redirect has been changed
  ~ resource "aws_lb_listener" "http_redirect" {
        id                                   = "arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/reviso-biz-redirect-alb/f81071d1fb62a779/99b84c1fc87e154c"
      + tags                                 = {}
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.redirect_reviso.aws_route53_record.old_app_domain has been changed
  ~ resource "aws_route53_record" "old_app_domain" {
        id                               = "Z0893527DM29OSHJP7NG_app.reviso.biz_A"
        name                             = "app.reviso.biz"
      + records                          = []
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.redirect_reviso.aws_lb_listener_rule.http_www_domain_redirect has been changed
  ~ resource "aws_lb_listener_rule" "http_www_domain_redirect" {
        id           = "arn:aws:elasticloadbalancing:us-west-2:533267310428:listener-rule/app/reviso-biz-redirect-alb/f81071d1fb62a779/99b84c1fc87e154c/c40ce9d1887bcb97"
      + tags         = {}
        # (4 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }
  # module.redirect_reviso.aws_acm_certificate.old_domain_cert has been changed
  ~ resource "aws_acm_certificate" "old_domain_cert" {
        id                        = "arn:aws:acm:us-west-2:533267310428:certificate/03ff5118-2632-4f96-ba3f-bcaa4d8770d8"
      + not_after                 = "2026-04-10T23:59:59Z"
      + not_before                = "2025-03-12T00:00:00Z"
      ~ status                    = "PENDING_VALIDATION" -> "ISSUED"
      + tags                      = {}
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.redirect_reviso.aws_lb.redirect_alb has been changed
  ~ resource "aws_lb" "redirect_alb" {
        id                                          = "arn:aws:elasticloadbalancing:us-west-2:533267310428:loadbalancer/app/reviso-biz-redirect-alb/f81071d1fb62a779"
        name                                        = "reviso-biz-redirect-alb"
      + tags                                        = {}
        # (24 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }
  # module.redirect_reviso.aws_lb_listener_rule.http_app_domain_redirect has been changed
  ~ resource "aws_lb_listener_rule" "http_app_domain_redirect" {
        id           = "arn:aws:elasticloadbalancing:us-west-2:533267310428:listener-rule/app/reviso-biz-redirect-alb/f81071d1fb62a779/99b84c1fc87e154c/d880f779e074893c"
      + tags         = {}
        # (4 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }
  # module.redirect_reviso.aws_lb_listener_rule.http_root_domain_redirect has been changed
  ~ resource "aws_lb_listener_rule" "http_root_domain_redirect" {
        id           = "arn:aws:elasticloadbalancing:us-west-2:533267310428:listener-rule/app/reviso-biz-redirect-alb/f81071d1fb62a779/99b84c1fc87e154c/3e8c5cae5807c4a6"
      + tags         = {}
        # (4 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }
  # module.redirect_reviso.aws_route53_record.old_root_domain has been changed
  ~ resource "aws_route53_record" "old_root_domain" {
        id                               = "Z0893527DM29OSHJP7NG_reviso.biz_A"
        name                             = "reviso.biz"
      + records                          = []
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.redirect_reviso.aws_route53_record.old_web_domain has been changed
  ~ resource "aws_route53_record" "old_web_domain" {
        id                               = "Z0893527DM29OSHJP7NG_www.reviso.biz_A"
        name                             = "www.reviso.biz"
      + records                          = []
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.postbuild_pointy.aws_ecs_service.server will be updated in-place
  ~ resource "aws_ecs_service" "server" {
        id                                 = "arn:aws:ecs:us-west-2:533267310428:service/pointy/pointy-server"
        name                               = "pointy-server"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:533267310428:task-definition/pointy-server:12" -> (known after apply)
        # (16 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.postbuild_pointy.aws_ecs_service.web will be updated in-place
  ~ resource "aws_ecs_service" "web" {
        id                                 = "arn:aws:ecs:us-west-2:533267310428:service/pointy/pointy-web"
        name                               = "pointy-web"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:533267310428:task-definition/pointy-web:12" -> (known after apply)
        # (16 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.postbuild_pointy.aws_ecs_task_definition.server must be replaced
-/+ resource "aws_ecs_task_definition" "server" {
      ~ arn                      = "arn:aws:ecs:us-west-2:533267310428:task-definition/pointy-server:12" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:533267310428:task-definition/pointy-server" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - environment           = [] -> null
                  - mountPoints           = [] -> null
                  - portMappings          = [] -> null
                  - systemControls        = [] -> null
                  - user                  = "0" -> null
                  - volumesFrom           = [] -> null
                    # (8 unchanged elements hidden)
                } # forces replacement,
              ~ {
                  ~ image            = "533267310428.dkr.ecr.us-west-2.amazonaws.com/pointy-server:1ae0cc58a2aea43bff8747ea2dafce42d8da6e6e" -> "533267310428.dkr.ecr.us-west-2.amazonaws.com/pointy-server:8173b7c19333889927eba06acd3e981319721a10"
                  - mountPoints      = [] -> null
                  ~ portMappings     = [
                      ~ {
                          - protocol      = "tcp" -> null
                            # (2 unchanged elements hidden)
                        },
                      ~ {
                          - protocol      = "tcp" -> null
                            # (2 unchanged elements hidden)
                        },
                    ]
                  - systemControls   = [] -> null
                  - volumesFrom      = [] -> null
                    # (6 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "pointy-server" -> (known after apply)
      ~ revision                 = 12 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.postbuild_pointy.aws_ecs_task_definition.web must be replaced
-/+ resource "aws_ecs_task_definition" "web" {
      ~ arn                      = "arn:aws:ecs:us-west-2:533267310428:task-definition/pointy-web:12" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:533267310428:task-definition/pointy-web" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ image            = "533267310428.dkr.ecr.us-west-2.amazonaws.com/pointy-web:1ae0cc58a2aea43bff8747ea2dafce42d8da6e6e" -> "533267310428.dkr.ecr.us-west-2.amazonaws.com/pointy-web:8173b7c19333889927eba06acd3e981319721a10"
                  - mountPoints      = [] -> null
                  ~ portMappings     = [
                      ~ {
                          - protocol      = "tcp" -> null
                            # (2 unchanged elements hidden)
                        },
                    ]
                  - systemControls   = [] -> null
                  - volumesFrom      = [] -> null
                    # (5 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "pointy-web" -> (known after apply)
      ~ revision                 = 12 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.redirect_reviso.aws_acm_certificate_validation.old_domain_cert_validation will be created
  + resource "aws_acm_certificate_validation" "old_domain_cert_validation" {
      + certificate_arn         = "arn:aws:acm:us-west-2:533267310428:certificate/03ff5118-2632-4f96-ba3f-bcaa4d8770d8"
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.redirect_reviso.aws_lb_listener.https_redirect will be created
  + resource "aws_lb_listener" "https_redirect" {
      + arn                                                                   = (known after apply)
      + certificate_arn                                                       = "arn:aws:acm:us-west-2:533267310428:certificate/03ff5118-2632-4f96-ba3f-bcaa4d8770d8"
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = "arn:aws:elasticloadbalancing:us-west-2:533267310428:loadbalancer/app/reviso-biz-redirect-alb/f81071d1fb62a779"
      + port                                                                  = 443
      + protocol                                                              = "HTTPS"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = "ELBSecurityPolicy-2016-08"
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Not Found"
              + status_code  = "404"
            }
        }

      + mutual_authentication {
          + advertise_trust_store_ca_names   = (known after apply)
          + ignore_client_certificate_expiry = (known after apply)
          + mode                             = (known after apply)
          + trust_store_arn                  = (known after apply)
        }
    }

  # module.redirect_reviso.aws_lb_listener_rule.https_app_domain_redirect will be created
  + resource "aws_lb_listener_rule" "https_app_domain_redirect" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 30
      + tags_all     = (known after apply)

      + action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "app.test.pointy.ai"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }

      + condition {
          + host_header {
              + values = [
                  + "app.reviso.biz",
                ]
            }
        }
    }

  # module.redirect_reviso.aws_lb_listener_rule.https_root_domain_redirect will be created
  + resource "aws_lb_listener_rule" "https_root_domain_redirect" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 10
      + tags_all     = (known after apply)

      + action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "test.pointy.ai"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }

      + condition {
          + host_header {
              + values = [
                  + "reviso.biz",
                ]
            }
        }
    }

  # module.redirect_reviso.aws_lb_listener_rule.https_www_domain_redirect will be created
  + resource "aws_lb_listener_rule" "https_www_domain_redirect" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 20
      + tags_all     = (known after apply)

      + action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "www.test.pointy.ai"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }

      + condition {
          + host_header {
              + values = [
                  + "www.reviso.biz",
                ]
            }
        }
    }

  # module.redirect_reviso.aws_lb_target_group.dummy_tg will be created
  + resource "aws_lb_target_group" "dummy_tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "reviso-biz-dummy-tg"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-031c9e9fe39bf5dd8"

      + health_check {
          + enabled             = false
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }

      + target_group_health {
          + dns_failover {
              + minimum_healthy_targets_count      = (known after apply)
              + minimum_healthy_targets_percentage = (known after apply)
            }

          + unhealthy_state_routing {
              + minimum_healthy_targets_count      = (known after apply)
              + minimum_healthy_targets_percentage = (known after apply)
            }
        }

      + target_health_state {
          + enable_unhealthy_connection_termination = (known after apply)
          + unhealthy_draining_interval             = (known after apply)
        }
    }

  # module.redirect_reviso.aws_route53_record.old_domain_cert_validation["app.reviso.biz"] will be created
  + resource "aws_route53_record" "old_domain_cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_9854a5a67cf79fa1702db63f34edcdbb.app.reviso.biz"
      + records         = [
          + "_2c1375ee8f986103af27e9afd9f43b80.sdgjtdhdhz.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z0893527DM29OSHJP7NG"
    }

  # module.redirect_reviso.aws_route53_record.old_domain_cert_validation["www.reviso.biz"] will be created
  + resource "aws_route53_record" "old_domain_cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_eb864fcbfa4ac2cd43a71c82d02521c7.www.reviso.biz"
      + records         = [
          + "_a9ff26143100c86519b3e24a944e777b.mhbtsbpdnt.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z0893527DM29OSHJP7NG"
    }

Plan: 10 to add, 2 to change, 2 to destroy.

Changes to Outputs:
  ~ pointy_ecs_deployment_task_definition = "arn:aws:ecs:us-west-2:533267310428:task-definition/pointy-server:12" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...


```

</details>

*Pushed by: @fivetentaylor, Action: `pull_request`*